In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

In [2]:
df = pd.read_json('movie.json')
df.head()

  cast genres                                 title  year
0   []     []            After Dark in Central Park  1900
1   []     []  Boarding School Girls' Pajama Parade  1900
2   []     []        Buffalo Bill's Wild West Parad  1900
3   []     []                                Caught  1900
4   []     []                  Clowns Spinning Hats  1900

In [3]:
df.describe()

               year
count  28795.000000
mean    1959.948984
std       31.125446
min     1900.000000
25%     1934.000000
50%     1952.000000
75%     1990.000000
max     2018.000000

In [5]:
new_data = df[28000:]
new_data.describe()

              year
count   795.000000
mean   2016.608805
std       1.234138
min    2014.000000
25%    2016.000000
50%    2017.000000
75%    2018.000000
max    2018.000000

In [6]:
new_data.head()

,cast,genres,title,year
28000,"[Sharon Leal, Boris Kodjoe, William Levy, Tash...",[Thriller],Addicted,2014
28001,"[Steve Carell, Jennifer Garner, Ed Oxenbould, ...",[Comedy],"Alexander and the Terrible, Horrible, No Good,...",2014
28002,"[Luke Evans, Sarah Gadon, Dominic Cooper, Zach...",[Fantasy],Dracula Untold,2014
28003,"[Robert Downey, Jr., Robert Duvall, Vera Farmi...",[Drama],The Judge,2014
28004,"[Miles Teller, Melissa Benoist, Austin Stowell]",[Drama],Whiplash,2014

In [10]:
new_data.to_json("movies.json", orient='records')

In [11]:
new_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 795 entries, 28000 to 28794
Data columns (total 4 columns):
cast      795 non-null object
genres    795 non-null object
title     795 non-null object
year      795 non-null int64
dtypes: int64(1), object(3)
memory usage: 24.9+ KB